### Numpy

In [144]:
import numpy as np
import pandas as pd

In [145]:
a = [2, 5, 7, 8, 3]

In [146]:
b = pd.Series(a)

In [147]:
b

0    2
1    5
2    7
3    8
4    3
dtype: int64

In [148]:
b=pd.Series(a, index = [0,1,2,3,4])

In [149]:
b

0    2
1    5
2    7
3    8
4    3
dtype: int64

In [150]:
b = pd.Series(a, index = ['a', 'b', 'c', 'd', 'e'])

In [151]:
b

a    2
b    5
c    7
d    8
e    3
dtype: int64

In [152]:
from datetime import date

In [153]:
ind = [date(y, m, d) for y, m, d in [(2018, 1, 15), (2018, 1, 17), (2018, 1, 18), (2018, 1, 21), (2018, 1, 31)]]

In [154]:
b = pd.Series(a, index = ind)

In [155]:
b

2018-01-15    2
2018-01-17    5
2018-01-18    7
2018-01-21    8
2018-01-31    3
dtype: int64

In [156]:
b.index

Index([2018-01-15, 2018-01-17, 2018-01-18, 2018-01-21, 2018-01-31], dtype='object')

In [157]:
b.index[0].year

2018

In [158]:
b.index = pd.to_datetime(b.index, format = '%Y-%m-%d')

In [159]:
b.index.year

Int64Index([2018, 2018, 2018, 2018, 2018], dtype='int64')

In [160]:
b = pd.Series(a, dtype = np.float64)

In [161]:
b

0    2.0
1    5.0
2    7.0
3    8.0
4    3.0
dtype: float64

In [162]:
b.index = [10, 11, 12, 13, 14]

In [163]:
b

10    2.0
11    5.0
12    7.0
13    8.0
14    3.0
dtype: float64

In [164]:
b.values

array([2., 5., 7., 8., 3.])

In [165]:
b

10    2.0
11    5.0
12    7.0
13    8.0
14    3.0
dtype: float64

In [166]:
b[10]

2.0

In [167]:
b[[10, 13]]

10    2.0
13    8.0
dtype: float64

In [168]:
b.head()

10    2.0
11    5.0
12    7.0
13    8.0
14    3.0
dtype: float64

In [169]:
b.head(3)

10    2.0
11    5.0
12    7.0
dtype: float64

In [170]:
b[b>5]

12    7.0
13    8.0
dtype: float64

In [171]:
b[(b == 7) | (b%3==0)]

12    7.0
14    3.0
dtype: float64

In [172]:
b = pd.Series([5, 6, 7, 8, 1, 3, 4])

In [173]:
b

0    5
1    6
2    7
3    8
4    1
5    3
6    4
dtype: int64

In [174]:
b[3] = 99

In [175]:
b

0     5
1     6
2     7
3    99
4     1
5     3
6     4
dtype: int64

In [176]:
b[b<5]=0

In [177]:
b[[0, 1, 2]] = 1

In [178]:
b

0     1
1     1
2     1
3    99
4     0
5     0
6     0
dtype: int64

In [179]:
b = b.append(pd.Series({7: 11, 8: 22, 9: 33, 10: 44}))

In [180]:
b

0      1
1      1
2      1
3     99
4      0
5      0
6      0
7     11
8     22
9     33
10    44
dtype: int64

In [181]:
b = b.drop([3, 6, 7])

In [182]:
b

0      1
1      1
2      1
4      0
5      0
8     22
9     33
10    44
dtype: int64

In [183]:
b.to_pickle('b.pkl')

In [184]:
b2 = pd.read_pickle('b.pkl')

In [185]:
b2

0      1
1      1
2      1
4      0
5      0
8     22
9     33
10    44
dtype: int64

In [186]:
df = pd.DataFrame({'Col1': ['a', 'b', 'c', 'd', 'e'],
                  'Col2': [1, 2, 3, 4, 5]}, columns=['Col1', 'Col2'])

In [187]:
df

  Col1  Col2
0    a     1
1    b     2
2    c     3
3    d     4
4    e     5

In [188]:
df.shape

(5, 2)

In [189]:
df.columns

Index(['Col1', 'Col2'], dtype='object')

In [190]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [191]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Col1    5 non-null      object
 1   Col2    5 non-null      int64
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

In [192]:
df.describe()

           Col2
count  5.000000
mean   3.000000
std    1.581139
min    1.000000
25%    2.000000
50%    3.000000
75%    4.000000
max    5.000000

In [193]:
df['Col1'].head()

0    a
1    b
2    c
3    d
4    e
Name: Col1, dtype: object

In [194]:
df.Col1.head(2)

0    a
1    b
Name: Col1, dtype: object

In [195]:
df.index = [2, 4, 6, 8, 10]

In [196]:
df

   Col1  Col2
2     a     1
4     b     2
6     c     3
8     d     4
10    e     5

In [197]:
df.loc[2, 'Col1']

'a'

In [198]:
df.loc[2, :]

Col1    a
Col2    1
Name: 2, dtype: object

In [199]:
df.iloc[4:8, :]

   Col1  Col2
10    e     5

In [200]:
df.loc[df['Col1']=='b', :]

  Col1  Col2
4    b     2

In [201]:
df.loc[df['Col1'] == 'b', 'Col2']

4    2
Name: Col2, dtype: int64

In [202]:
df.loc[df['Col1'] == 'b', 'Col2'].values

array([2], dtype=int64)

In [203]:
df.loc[df['Col2'].between(2, 4), :]

  Col1  Col2
4    b     2
6    c     3
8    d     4

In [204]:
df

   Col1  Col2
2     a     1
4     b     2
6     c     3
8     d     4
10    e     5

In [205]:
df.query('Col1 == "b"')

  Col1  Col2
4    b     2

In [206]:
df.query('Col2 > 3')

   Col1  Col2
8     d     4
10    e     5

In [207]:
s = df['Col1']

In [208]:
s

2     a
4     b
6     c
8     d
10    e
Name: Col1, dtype: object

In [209]:
type(s)

pandas.core.series.Series

In [210]:
df2 = pd.DataFrame(s)

In [211]:
df2

   Col1
2     a
4     b
6     c
8     d
10    e

In [212]:
df_copy = df.copy()

In [213]:
df_copy

   Col1  Col2
2     a     1
4     b     2
6     c     3
8     d     4
10    e     5

In [214]:
df.sample(n=2)

   Col1  Col2
6     c     3
10    e     5

In [215]:
df.sample(frac=0.5)

   Col1  Col2
8     d     4
10    e     5

In [216]:
df.sample(frac=0.5, replace = True)

  Col1  Col2
8    d     4
4    b     2

In [217]:
df.sample(frac=1.0, random_state=42)

   Col1  Col2
4     b     2
10    e     5
6     c     3
2     a     1
8     d     4

In [218]:
df.to_csv('Test.csv', sep = ';', index = False)

In [219]:
df_new = pd.read_csv('Test.csv', sep = ';')

In [220]:
df_new

  Col1  Col2
0    a     1
1    b     2
2    c     3
3    d     4
4    e     5

In [221]:
authors = pd.DataFrame({'authors_id': [1, 2, 3], 'author_name': ['Pushkin', 'Tolstoy', 'Dostoevsky']}, 
                       columns = ['authors_id', 'author_name'])

In [222]:
authors

   authors_id author_name
0           1     Pushkin
1           2     Tolstoy
2           3  Dostoevsky

In [223]:
books = pd.DataFrame({'authors_id': [2, 3, 3, 4], 
                      'book_title': ['War and Peace', 'The Idiot', 'Crime and Punishment', 'Father and Sons']})

In [224]:
books

   authors_id            book_title
0           2         War and Peace
1           3             The Idiot
2           3  Crime and Punishment
3           4       Father and Sons

In [225]:
df1 = pd.merge(authors, books, on = 'authors_id', how = 'inner')

In [226]:
df1

   authors_id author_name            book_title
0           2     Tolstoy         War and Peace
1           3  Dostoevsky             The Idiot
2           3  Dostoevsky  Crime and Punishment

In [227]:
df2 = pd.merge(authors, books, on = 'authors_id', how = 'left')

In [228]:
df2

   authors_id author_name            book_title
0           1     Pushkin                   NaN
1           2     Tolstoy         War and Peace
2           3  Dostoevsky             The Idiot
3           3  Dostoevsky  Crime and Punishment

In [229]:
df3 = pd.merge(authors, books, on = 'authors_id', how = 'right')

In [230]:
df3

   authors_id author_name            book_title
0           2     Tolstoy         War and Peace
1           3  Dostoevsky             The Idiot
2           3  Dostoevsky  Crime and Punishment
3           4         NaN       Father and Sons

In [231]:
df4 = pd.merge(authors, books, on = 'authors_id', how = 'outer')
df4

   authors_id author_name            book_title
0           1     Pushkin                   NaN
1           2     Tolstoy         War and Peace
2           3  Dostoevsky             The Idiot
3           3  Dostoevsky  Crime and Punishment
4           4         NaN       Father and Sons

In [232]:
df4.loc[df4['book_title'].isnull(), :]

   authors_id author_name book_title
0           1     Pushkin        NaN

In [233]:
df4.loc[df4['author_name'].notnull(), :]

   authors_id author_name            book_title
0           1     Pushkin                   NaN
1           2     Tolstoy         War and Peace
2           3  Dostoevsky             The Idiot
3           3  Dostoevsky  Crime and Punishment

In [234]:
df4['book_title'] = df4['book_title'].fillna('unknown')

In [235]:
df4

   authors_id author_name            book_title
0           1     Pushkin               unknown
1           2     Tolstoy         War and Peace
2           3  Dostoevsky             The Idiot
3           3  Dostoevsky  Crime and Punishment
4           4         NaN       Father and Sons

In [236]:
df4['author_name'].fillna('unknown', inplace = True)

In [237]:
df4

   authors_id author_name            book_title
0           1     Pushkin               unknown
1           2     Tolstoy         War and Peace
2           3  Dostoevsky             The Idiot
3           3  Dostoevsky  Crime and Punishment
4           4     unknown       Father and Sons

In [238]:
df4.loc[(df4['author_name'] != 'unknown') & (df4['book_title'] != 'unknown'), 'quantity'] = 1

In [239]:
df4

   authors_id author_name            book_title  quantity
0           1     Pushkin               unknown       NaN
1           2     Tolstoy         War and Peace       1.0
2           3  Dostoevsky             The Idiot       1.0
3           3  Dostoevsky  Crime and Punishment       1.0
4           4     unknown       Father and Sons       NaN

In [240]:
df4['quantity'].fillna(0, inplace = True)

In [241]:
df4

   authors_id author_name            book_title  quantity
0           1     Pushkin               unknown       0.0
1           2     Tolstoy         War and Peace       1.0
2           3  Dostoevsky             The Idiot       1.0
3           3  Dostoevsky  Crime and Punishment       1.0
4           4     unknown       Father and Sons       0.0

In [242]:
df4['quantity'] = df4['quantity'].astype(int)

In [243]:
df4

   authors_id author_name            book_title  quantity
0           1     Pushkin               unknown         0
1           2     Tolstoy         War and Peace         1
2           3  Dostoevsky             The Idiot         1
3           3  Dostoevsky  Crime and Punishment         1
4           4     unknown       Father and Sons         0

In [244]:
df4

   authors_id author_name            book_title  quantity
0           1     Pushkin               unknown         0
1           2     Tolstoy         War and Peace         1
2           3  Dostoevsky             The Idiot         1
3           3  Dostoevsky  Crime and Punishment         1
4           4     unknown       Father and Sons         0

In [245]:
df4.reset_index(inplace = True)

In [246]:
df4

   index  authors_id author_name            book_title  quantity
0      0           1     Pushkin               unknown         0
1      1           2     Tolstoy         War and Peace         1
2      2           3  Dostoevsky             The Idiot         1
3      3           3  Dostoevsky  Crime and Punishment         1
4      4           4     unknown       Father and Sons         0

In [247]:
df4['price'] = 500

In [248]:
df4

   index  authors_id author_name            book_title  quantity  price
0      0           1     Pushkin               unknown         0    500
1      1           2     Tolstoy         War and Peace         1    500
2      2           3  Dostoevsky             The Idiot         1    500
3      3           3  Dostoevsky  Crime and Punishment         1    500
4      4           4     unknown       Father and Sons         0    500

In [249]:
df4 = df4.drop('price', axis = 1)

In [250]:
df4

   index  authors_id author_name            book_title  quantity
0      0           1     Pushkin               unknown         0
1      1           2     Tolstoy         War and Peace         1
2      2           3  Dostoevsky             The Idiot         1
3      3           3  Dostoevsky  Crime and Punishment         1
4      4           4     unknown       Father and Sons         0

In [251]:
df4 = df4.drop(1, axis = 0)

In [252]:
df4

   index  authors_id author_name            book_title  quantity
0      0           1     Pushkin               unknown         0
2      2           3  Dostoevsky             The Idiot         1
3      3           3  Dostoevsky  Crime and Punishment         1
4      4           4     unknown       Father and Sons         0

In [253]:
df4 = df4.append(pd.DataFrame({'authors_id': [2], 'author_name': ['Tolstoy'], 'book_title': ['War and Peace'], 
                               'quantity': [1]}, columns = ['authors_id', 'author_name', 'book_title']), ignore_index=True)

In [254]:
df4

   index  authors_id author_name            book_title  quantity
0    0.0           1     Pushkin               unknown       0.0
1    2.0           3  Dostoevsky             The Idiot       1.0
2    3.0           3  Dostoevsky  Crime and Punishment       1.0
3    4.0           4     unknown       Father and Sons       0.0
4    NaN           2     Tolstoy         War and Peace       NaN

In [255]:
df4 = df4.sort_values(by='authors_id')

In [256]:
df4

   index  authors_id author_name            book_title  quantity
0    0.0           1     Pushkin               unknown       0.0
4    NaN           2     Tolstoy         War and Peace       NaN
1    2.0           3  Dostoevsky             The Idiot       1.0
2    3.0           3  Dostoevsky  Crime and Punishment       1.0
3    4.0           4     unknown       Father and Sons       0.0

In [257]:
df4 = df4.reset_index(drop=True)

In [258]:
df4

   index  authors_id author_name            book_title  quantity
0    0.0           1     Pushkin               unknown       0.0
1    NaN           2     Tolstoy         War and Peace       NaN
2    2.0           3  Dostoevsky             The Idiot       1.0
3    3.0           3  Dostoevsky  Crime and Punishment       1.0
4    4.0           4     unknown       Father and Sons       0.0

In [259]:
df5 = pd.DataFrame({'authors_id': [3, 5], 'author_name': ['Dostoevsky', 'Chekhov'], 
                    'book_title': ['The Gamlet', 'Three Sisters'], 'quantity': [2, 3]}, 
                   columns = ['authors_id', 'author_name', 'book_title', 'quantity'])
df5

   authors_id author_name     book_title  quantity
0           3  Dostoevsky     The Gamlet         2
1           5     Chekhov  Three Sisters         3

In [260]:
df6 = pd.concat([df4, df5], axis = 0, ignore_index = True)
df6

   index  authors_id author_name            book_title  quantity
0    0.0           1     Pushkin               unknown       0.0
1    NaN           2     Tolstoy         War and Peace       NaN
2    2.0           3  Dostoevsky             The Idiot       1.0
3    3.0           3  Dostoevsky  Crime and Punishment       1.0
4    4.0           4     unknown       Father and Sons       0.0
5    NaN           3  Dostoevsky            The Gamlet       2.0
6    NaN           5     Chekhov         Three Sisters       3.0

In [261]:
prices = pd.DataFrame({'price': [700, 400, 500, 450, 350]}, columns=['price'], index = [1, 2, 3, 5, 6])
prices

   price
1    700
2    400
3    500
5    450
6    350

In [262]:
df7 = pd.concat([df6, prices], axis=1)

In [263]:
df7

   index  authors_id author_name            book_title  quantity  price
0    0.0           1     Pushkin               unknown       0.0    NaN
1    NaN           2     Tolstoy         War and Peace       NaN  700.0
2    2.0           3  Dostoevsky             The Idiot       1.0  400.0
3    3.0           3  Dostoevsky  Crime and Punishment       1.0  500.0
4    4.0           4     unknown       Father and Sons       0.0    NaN
5    NaN           3  Dostoevsky            The Gamlet       2.0  450.0
6    NaN           5     Chekhov         Three Sisters       3.0  350.0

In [264]:
df7['total'] = df7['quantity']*df7['price']

In [265]:
df7

,index,authors_id,author_name,book_title,quantity,price,total
0,0.0,1,Pushkin,unknown,0.0,NaN,NaN
1,NaN,2,Tolstoy,War and Peace,NaN,700.0,NaN
2,2.0,3,Dostoevsky,The Idiot,1.0,400.0,400.0
3,3.0,3,Dostoevsky,Crime and Punishment,1.0,500.0,500.0
4,4.0,4,unknown,Father and Sons,0.0,NaN,NaN
5,NaN,3,Dostoevsky,The Gamlet,2.0,450.0,900.0
6,NaN,5,Chekhov,Three Sisters,3.0,350.0,1050.0

In [266]:
df7['price'].max()

700.0

In [267]:
df7['price'].min()

350.0

In [268]:
df7['price'].mean()

480.0

In [269]:
df7['price'].median()

450.0

In [270]:
df7['price'].std()

135.09256086106296

In [271]:
df7['price'].var()

18250.0

In [272]:
df7.nlargest(3, 'price')

   index  authors_id author_name            book_title  quantity  price  total
1    NaN           2     Tolstoy         War and Peace       NaN  700.0    NaN
3    3.0           3  Dostoevsky  Crime and Punishment       1.0  500.0  500.0
5    NaN           3  Dostoevsky            The Gamlet       2.0  450.0  900.0

In [273]:
df7['author_name'].unique()

array(['Pushkin', 'Tolstoy', 'Dostoevsky', 'unknown', 'Chekhov'],
      dtype=object)

In [274]:
df7['author_name'].nunique()

5

In [275]:
df7['author_name'].value_counts()

Dostoevsky    3
Pushkin       1
Tolstoy       1
unknown       1
Chekhov       1
Name: author_name, dtype: int64

In [276]:
df7['book_title'].apply(lambda x: x.upper())

0                 UNKNOWN
1           WAR AND PEACE
2               THE IDIOT
3    CRIME AND PUNISHMENT
4         FATHER AND SONS
5              THE GAMLET
6           THREE SISTERS
Name: book_title, dtype: object

In [277]:
df7.groupby('author_name')['price'].max()

author_name
Chekhov       350.0
Dostoevsky    500.0
Pushkin         NaN
Tolstoy       700.0
unknown         NaN
Name: price, dtype: float64

In [278]:
price_agg = df7.groupby('author_name').agg({'price': 'max'})

In [279]:
price_agg

             price
author_name
Chekhov      350.0
Dostoevsky   500.0
Pushkin        NaN
Tolstoy      700.0
unknown        NaN

In [280]:
price_agg = price_agg.reset_index()
price_agg = price_agg.rename(columns = {'price': 'max_price'})
price_agg

  author_name  max_price
0     Chekhov      350.0
1  Dostoevsky      500.0
2     Pushkin        NaN
3     Tolstoy      700.0
4     unknown        NaN